# Week 5 Day 1 - Pandas

[Pandas](https://pandas.pydata.org) is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. It is free software released under the three-clause BSD license.

In [1]:
import pandas as pd

In [3]:
# make a dictionary with lists as values
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

In [5]:
#make it a dataframe

mycars =

SyntaxError: invalid syntax (3644512613.py, line 3)

In [3]:
#get the information of your dataframe

In [7]:
#get the shape of your dataframe

mycars.shape

NameError: name 'mycars' is not defined

In [9]:
#get the columns

mycars.columns

NameError: name 'mycars' is not defined

In [11]:
#get the rows

mycars.values

NameError: name 'mycars' is not defined

In [7]:
#get the axis

In [13]:
#get the first row

mycars[0]

NameError: name 'mycars' is not defined

In [15]:
#use a list of indexs:

mycars.loc[[0,2]]

NameError: name 'mycars' is not defined

In [17]:
#get a column

mycars['cars']

NameError: name 'mycars' is not defined

In [11]:
#get the rows

In [19]:
#what are the datatypes of the dataframe

mycars.dtypes

NameError: name 'mycars' is not defined

In [13]:
#change 'passings' to float

mycars['passings'] = mycars['passings'].astype('float')

In [21]:
#look at it again

mycars.dtypes

NameError: name 'mycars' is not defined

In [15]:
#get rid of the last row

mycars.drop(2)

In [16]:
#get rid of the passings column

mycars.drop['passing']

<!--  -->

### NaN & empty data

In [29]:
import numpy as np

uglyData = {
  'cars': ["BMW", 'Jeep', "Ford", 'Chrysler'],
  'passings': [3, np.nan, 2, 'NaN']
}

uglyDF = pd.DataFrame(uglyData)

In [31]:
uglyDF

       cars passings
0       BMW        3
1      Jeep      NaN
2      Ford        2
3  Chrysler      NaN

In [33]:
#drop the Nan

cleanDF = uglyDF.dropna()

In [35]:
cleanDF

       cars passings
0       BMW        3
2      Ford        2
3  Chrysler      NaN

In [37]:
#replace it with 0

clean2DF = uglyDF.fillna("NaN")
clean2DF

       cars passings
0       BMW        3
1      Jeep      NaN
2      Ford        2
3  Chrysler      NaN

<!--  -->

### .csv Files

**pd.read_csv** 

A simple way to store big data sets is to use CSV files (comma separated files).
CSV files contains plain text and is a well know format that can be read by everyone including Pandas.

*pd.read_csv(filepath_or_buffer, sep=’ ,’ , header=’infer’,  index_col=None, usecols=None, engine=None, skiprows=None, nrows=None)*

In [39]:
#import tv_shows.csv
df = pd.read_csv('data/tv_shows.csv')

In [41]:
df

,Unnamed: 0,title,year,runtime,rating,votes,genre,text
0,0,Game of Thrones,(2011 TV Series),55 mins.,9.5,"748,557","[u'Adventure', u'Drama', u'Fantasy']",Several noble families fight for control of th...
1,1,Breaking Bad,(2008 TV Series),45 mins.,9.5,"662,459","[u'Crime', u'Drama', u'Thriller']",A chemistry teacher diagnosed with a terminal ...
2,2,The Walking Dead,(2010 TV Series),44 mins.,8.7,"500,301","[u'Drama', u'Horror']",Sheriff's Deputy Rick Grimes leads a group of ...
3,3,The Big Bang Theory,(2007 TV Series),22 mins.,8.5,"438,226",[u'Comedy'],A woman who moves into an apartment across the...
4,4,Dexter,(2006 TV Series),55 mins.,8.9,"419,031","[u'Crime', u'Drama', u'Mystery', u'Thriller']",A Miami police forensics expert moonlights as ...
...,...,...,...,...,...,...,...,...
1969,1969,Cristela,(2014 TV Series),30 mins.,6.3,"1,510",[u'Comedy'],"In her sixth year of law school, Cristela is f..."
1970,1970,Power Rangers in Space,(1998 TV Series),30 mins.,7.2,"1,504","[u'Action', u'Adventure', u'Family', u'Sci-Fi']",The most evil forces of the universe (Rita &am...
1971,1971,Reading Rainbow,(1983 TV Series),30 mins.,8.5,"1,501",[u'Family'],Levar Burton introduces young viewers to illus...
1972,1972,Martial Law,(1998 TV Series),45 mins.,7.1,"1,501","[u'Comedy', u'Crime', u'Action']",A Shanghai cop who is a master of martial arts...
1973,1973,Beast Machines: Transformers,(1999 TV Series),30 mins.,6.9,"1,500","[u'Action', u'Animation', u'Sci-Fi']",The Maximals awaken on their home planet of Cy...

In [45]:
#get a preview

df.head()

,Unnamed: 0,title,year,runtime,rating,votes,genre,text
0,0,Game of Thrones,(2011 TV Series),55 mins.,9.5,"748,557","[u'Adventure', u'Drama', u'Fantasy']",Several noble families fight for control of th...
1,1,Breaking Bad,(2008 TV Series),45 mins.,9.5,"662,459","[u'Crime', u'Drama', u'Thriller']",A chemistry teacher diagnosed with a terminal ...
2,2,The Walking Dead,(2010 TV Series),44 mins.,8.7,"500,301","[u'Drama', u'Horror']",Sheriff's Deputy Rick Grimes leads a group of ...
3,3,The Big Bang Theory,(2007 TV Series),22 mins.,8.5,"438,226",[u'Comedy'],A woman who moves into an apartment across the...
4,4,Dexter,(2006 TV Series),55 mins.,8.9,"419,031","[u'Crime', u'Drama', u'Mystery', u'Thriller']",A Miami police forensics expert moonlights as ...

In [47]:
#what columns of the csv file

df.columns

Index(['Unnamed: 0', 'title', 'year', 'runtime', 'rating', 'votes', 'genre',
       'text'],
      dtype='object')

In [49]:
# Return the number of not empty cells for each column/row

df.count()

Unnamed: 0    1974
title         1974
year          1974
runtime       1814
rating        1974
votes         1974
genre         1970
text          1941
dtype: int64

In [51]:
df2 = df.dropna()
df2.count()

Unnamed: 0    1792
title         1792
year          1792
runtime       1792
rating        1792
votes         1792
genre         1792
text          1792
dtype: int64

In [55]:
#only import the columns ["title", "year", "rating", "votes"]

df3 = pd.read_csv('data/tv_shows.csv', usecols = ["title", "year", "rating", "votes"])

df3.head()

                 title              year  rating    votes
0      Game of Thrones  (2011 TV Series)     9.5  748,557
1         Breaking Bad  (2008 TV Series)     9.5  662,459
2     The Walking Dead  (2010 TV Series)     8.7  500,301
3  The Big Bang Theory  (2007 TV Series)     8.5  438,226
4               Dexter  (2006 TV Series)     8.9  419,031

In [57]:
df3.count()

title     1974
year      1974
rating    1974
votes     1974
dtype: int64

In [59]:
#what is the maximum rating? 

df3['rating'].max()

9.6

In [61]:
#what is the minimum rating?

df3['rating'].min()

1.8

In [63]:
#find the avg of all of the ratings

avgRating = df3['rating'].mean()
avgRating

7.486524822695036

In [65]:
#what data types of the dataframe? 

df3.dtypes

title      object
year       object
rating    float64
votes      object
dtype: object

In [69]:
#can you change the datatype of votes?

df3['votes'] = df3['votes'].astype('float64')

ValueError: could not convert string to float: '748,557'

In [81]:
#set the index to be the names of the tv show

df4 = df3.set_index('title')

df4.head()

                                 year  rating    votes
title
Game of Thrones      (2011 TV Series)     9.5  748,557
Breaking Bad         (2008 TV Series)     9.5  662,459
The Walking Dead     (2010 TV Series)     8.7  500,301
The Big Bang Theory  (2007 TV Series)     8.5  438,226
Dexter               (2006 TV Series)     8.9  419,031

In [79]:
#get the year of hte new dataframe

df4['year']

title
Game of Thrones                 (2011 TV Series)
Breaking Bad                    (2008 TV Series)
The Walking Dead                (2010 TV Series)
The Big Bang Theory             (2007 TV Series)
Dexter                          (2006 TV Series)
                                      ...
Cristela                        (2014 TV Series)
Power Rangers in Space          (1998 TV Series)
Reading Rainbow                 (1983 TV Series)
Martial Law                     (1998 TV Series)
Beast Machines: Transformers    (1999 TV Series)
Name: year, Length: 1974, dtype: object

<!--  -->

### .json files

**pd.read_json**

JSON = Python Dictionary

JSON objects have the same format as Python dictionaries. If your JSON code is not in a file, but in a Python Dictionary, you can load it into a DataFrame directly.

In [83]:
dataJson = {
    'item1':{
        "0":60,
        "1":60,
        "2":60
    },
    'item2':{
        '0':100,
        '1':100,
        '2':100
    }
}

In [85]:
dfjson = pd.DataFrame(dataJson)

In [91]:
#read in nationalParks.json

df = pd.read_json('data/nationalParks.json')

df.head()

,area,coordinates,date_established_readable,date_established_unix,description,image,nps_link,states,title,id,visitors,world_heritage_site
0,"{'acres': '49,057.36', 'square_km': '198.5'}","{'latitude': 44.35, 'longitude': -68.21}","February 26, 1919",-1604599200,Covering most of Mount Desert Island and other...,"{'url': 'acadia.jpg', 'attribution': 'PixelBay...",https://www.nps.gov/acad/index.htm,"[{'id': 'state_maine', 'title': 'Maine'}]",Acadia,park_acadia,"3,303,393",False
1,"{'acres': '8,256.67', 'square_km': '33.4'}","{'latitude': -14.25, 'longitude': -170.68}","October 31, 1988",594280800,The southernmost National Park is on three Sam...,"{'url': 'american-samoa.jpg', 'attribution': '...",https://www.nps.gov/npsa/index.htm,"[{'id': 'state_american-samoa', 'title': 'Amer...",American Samoa,park_american-samoa,"28,892",False
2,"{'acres': '76,678.98', 'square_km': '310.3'}","{'latitude': 38.68, 'longitude': -109.57}","November 12, 1971",58773600,"This site features more than 2,000 natural san...","{'url': 'arches.jpg', 'attribution': 'PixelBay...",https://www.nps.gov/arch/index.htm,"[{'id': 'state_utah', 'title': 'Utah'}]",Arches,park_arches,"1,585,718",False
3,"{'acres': '242,755.94', 'square_km': '982.4'}","{'latitude': 43.75, 'longitude': -102.5}","November 10, 1978",279525600,"The Badlands are a collection of buttes, pinna...","{'url': 'badlands.jpg', 'attribution': 'PixelB...",https://www.nps.gov/badl/index.htm,"[{'id': 'state_south-dakota', 'title': 'South ...",Badlands,park_badlands,"996,263",False
4,"{'acres': '801,163.21', 'square_km': '3,242.2'}","{'latitude': 29.25, 'longitude': -103.25}","June 12, 1944",-806439600,Named for the prominent bend in the Rio Grande...,"{'url': 'big-bend.jpg', 'attribution': 'PixelB...",https://www.nps.gov/bibe/index.htm,"[{'id': 'state_texas', 'title': 'Texas'}]",Big Bend,park_big-bend,"388,290",False

In [95]:
#only get the ['date_established_readable','description', 'title', 'visitors', 'world_heritage_site', 'states ]

df2 = df[['title', 'visitors', 'world_heritage_site', 'states', 'date_established_readable','description']]

df2.head()

,title,visitors,world_heritage_site,states,date_established_readable,description
0,Acadia,"3,303,393",False,"[{'id': 'state_maine', 'title': 'Maine'}]","February 26, 1919",Covering most of Mount Desert Island and other...
1,American Samoa,"28,892",False,"[{'id': 'state_american-samoa', 'title': 'Amer...","October 31, 1988",The southernmost National Park is on three Sam...
2,Arches,"1,585,718",False,"[{'id': 'state_utah', 'title': 'Utah'}]","November 12, 1971","This site features more than 2,000 natural san..."
3,Badlands,"996,263",False,"[{'id': 'state_south-dakota', 'title': 'South ...","November 10, 1978","The Badlands are a collection of buttes, pinna..."
4,Big Bend,"388,290",False,"[{'id': 'state_texas', 'title': 'Texas'}]","June 12, 1944",Named for the prominent bend in the Rio Grande...

In [97]:
#get the datatypes

df2.dtypes

title                        object
visitors                     object
world_heritage_site            bool
states                       object
date_established_readable    object
description                  object
dtype: object

In [101]:
#find the national parks that are world heritage sites

whsNum = df2[df2['world_heritage_site'] == True]

whsNum

,title,visitors,world_heritage_site,states,date_established_readable,description
10,Carlsbad Caverns,"466,773",True,"[{'id': 'state_new-mexico', 'title': 'New Mexi...","May 14, 1930","Carlsbad Caverns has 117 caves, the longest of..."
18,Everglades,"930,907",True,"[{'id': 'state_florida', 'title': 'Florida'}]","May 30, 1934",The Everglades are the largest tropical wilder...
20,Glacier,"2,946,681",True,"[{'id': 'state_montana', 'title': 'Montana'}]","May 11, 1910",The U.S. half of Waterton-Glacier Internationa...
21,Glacier Bay,"520,171",True,"[{'id': 'state_alaska', 'title': 'Alaska'}]","December 2, 1980","Glacier Bay contains tidewater glaciers, mount..."
22,Grand Canyon,"5,969,811",True,"[{'id': 'state_arizona', 'title': 'Arizona'}]","February 26, 1919","The Grand Canyon, carved by the mighty Colorad..."
26,Great Smoky Mountains,"11,312,786",True,"[{'id': 'state_tennessee', 'title': 'Tennessee...","June 15, 1934","The Great Smoky Mountains, part of the Appalac..."
29,Hawaii Volcanoes,"1,887,580",True,"[{'id': 'state_hawaii', 'title': 'Hawaii'}]","August 1, 1916",This park on the Big Island protects the Kīlau...
39,Mammoth Cave,"586,514",True,"[{'id': 'state_kentucky', 'title': 'Kentucky'}]","July 1, 1941",With more than 400 miles (640 km) of passagewa...
40,Mesa Verde,"583,527",True,"[{'id': 'state_colorado', 'title': 'Colorado'}]","June 29, 1906","This area constitutes over 4,000 archaeologica..."
43,Olympic,"3,390,221",True,"[{'id': 'state_washington', 'title': 'Washingt...","June 29, 1938","Situated on the Olympic Peninsula, this park i..."
46,Redwood,"536,297",True,"[{'id': 'state_california', 'title': 'Californ...","October 2, 1968",This park and the co-managed state parks prote...
55,Wrangell–St. Elias,"79,047",True,"[{'id': 'state_alaska', 'title': 'Alaska'}]","December 2, 1980","An over 8 million acres (32,375 km2) plot of m..."
56,Yellowstone,"4,257,177",True,"[{'id': 'state_wyoming', 'title': 'Wyoming'}, ...","March 1, 1872","Situated on the Yellowstone Caldera, the park ..."
57,Yosemite,"5,028,868",True,"[{'id': 'state_california', 'title': 'Californ...","October 1, 1890","Yosemite features sheer granite cliffs, except..."

<!--  -->

#### Exercise 1: get the national parks with over a million visitors

In [113]:
df2_cleanVis = df2

df2_cleanVis['visitors'] = df2_cleanVis['visitors'].replace(',','', regex = True)

df2_cleanVis.head()

C:\Users\kylemcp\AppData\Local\Temp\ipykernel_5800\51768232.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2_cleanVis['visitors'] = df2_cleanVis['visitors'].replace(',','', regex = True)

,title,visitors,world_heritage_site,states,date_established_readable,description
0,Acadia,3303393,False,"[{'id': 'state_maine', 'title': 'Maine'}]","February 26, 1919",Covering most of Mount Desert Island and other...
1,American Samoa,28892,False,"[{'id': 'state_american-samoa', 'title': 'Amer...","October 31, 1988",The southernmost National Park is on three Sam...
2,Arches,1585718,False,"[{'id': 'state_utah', 'title': 'Utah'}]","November 12, 1971","This site features more than 2,000 natural san..."
3,Badlands,996263,False,"[{'id': 'state_south-dakota', 'title': 'South ...","November 10, 1978","The Badlands are a collection of buttes, pinna..."
4,Big Bend,388290,False,"[{'id': 'state_texas', 'title': 'Texas'}]","June 12, 1944",Named for the prominent bend in the Rio Grande...

In [115]:
df2_cleanVis.dtypes

title                        object
visitors                     object
world_heritage_site            bool
states                       object
date_established_readable    object
description                  object
dtype: object

In [117]:
df2_cleanVis['visitors'] = df2_cleanVis['visitors'].astype('float')

df2_cleanVis.head()

C:\Users\kylemcp\AppData\Local\Temp\ipykernel_5800\3495534458.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2_cleanVis['visitors'] = df2_cleanVis['visitors'].astype('float')

,title,visitors,world_heritage_site,states,date_established_readable,description
0,Acadia,3303393.0,False,"[{'id': 'state_maine', 'title': 'Maine'}]","February 26, 1919",Covering most of Mount Desert Island and other...
1,American Samoa,28892.0,False,"[{'id': 'state_american-samoa', 'title': 'Amer...","October 31, 1988",The southernmost National Park is on three Sam...
2,Arches,1585718.0,False,"[{'id': 'state_utah', 'title': 'Utah'}]","November 12, 1971","This site features more than 2,000 natural san..."
3,Badlands,996263.0,False,"[{'id': 'state_south-dakota', 'title': 'South ...","November 10, 1978","The Badlands are a collection of buttes, pinna..."
4,Big Bend,388290.0,False,"[{'id': 'state_texas', 'title': 'Texas'}]","June 12, 1944",Named for the prominent bend in the Rio Grande...

In [121]:
milVis = df2_cleanVis[df2_cleanVis['visitors'] > 1000000]

In [123]:
milVis.head()

,title,visitors,world_heritage_site,states,date_established_readable,description
0,Acadia,3303393.0,False,"[{'id': 'state_maine', 'title': 'Maine'}]","February 26, 1919",Covering most of Mount Desert Island and other...
2,Arches,1585718.0,False,"[{'id': 'state_utah', 'title': 'Utah'}]","November 12, 1971","This site features more than 2,000 natural san..."
7,Bryce Canyon,2365110.0,False,"[{'id': 'state_utah', 'title': 'Utah'}]","February 25, 1928",Bryce Canyon is a geological amphitheater on t...
9,Capitol Reef,1064904.0,False,"[{'id': 'state_utah', 'title': 'Utah'}]","December 18, 1971",The park's Waterpocket Fold is a 100-mile (160...
14,Cuyahoga Valley,2423390.0,False,"[{'id': 'state_ohio', 'title': 'Ohio'}]","October 11, 2000",This park along the Cuyahoga River has waterfa...

<!--  -->

### Exercise 2: Create a dictionary of the number of national parks per state